package com.jcp.day6;

/*
 * 만약에 성적처리할 학생 데이터 100개 -> 배열에 저장.
 * 성적처리에 사용할 데이터는 학생 이름, 국어,영어,수학 점수
 * 
 */
public class ArraysTest {

	public static void main(String[] args) {
		String[] name = new String[100];    //100명 이름 저장
		int[] kor = new int[100];   //100명 국어점수 저장.
		int[] eng = new int[100];
		int[] math  = new int[100];
		
		//다른 프로그래밍언 예를 들면 C언어에서는 구조체로 사용하여 데이터 중심으로 변환했습니다.
		//자바에서는 클래스를 정의할 것이고 구조체와 다른 점은 메소드를 정의하고 더 다양한 방식으로 활용합니다.
		//   --> 객체 지향 프로그래밍 
		
		
		//지금까지의 클래스는 main 메소드를 포함하여 프로그램 실행의 출발점으로 사용하던 클래스입니다.
		//지금부터 만드는 클래스는 객체를 생성하기 위해 사용할 원본(정의) 역할을 하는 클래스 입니다.

	}

}
